/*
 * @Author: your name
 * @Date: 2021-09-16 21:05:01
 * @LastEditTime: 2021-09-16 21:26:53
 * @LastEditors: Please set LastEditors
 * @Description: In User Settings Edit
 * @FilePath: /if3/lib/ipparse/ipparse.go
 */
package region

import (
	"bufio"
	"bytes"
	"fmt"
	"io"
	"net"
	"os"
	"strings"
)

//ip、lbs信息转地域ID
type Ips struct {
	Ipv4s []map[string][]byte
	Ipv6s []map[string][]byte
	Lbs   map[int64]int
}

var sysIp *Ips

var area map[string]string

//初始化地域ID
func Area_Init() {

	area = make(map[string]string)

	areatmp := `115611=北京
	115612=天津
	115631=上海
	115650=重庆
	115800=台湾
	134400=香港
	144600=澳门
	115613=河北
	11561301=石家庄
	11561302=唐山
	11561303=秦皇岛
	11561304=邯郸
	11561305=邢台
	11561306=保定
	11561307=张家口
	11561308=承德
	11561309=沧州
	11561310=廊坊
	11561311=衡水
	115614=山西
	11561401=太原
	11561402=大同
	11561403=阳泉
	11561404=长治
	11561405=晋城
	11561406=朔州
	11561407=晋中
	11561408=运城
	11561409=忻州
	11561410=临汾
	11561411=吕梁
	115615=内蒙古
	11561501=呼和浩特
	11561502=包头
	11561503=乌海
	11561504=赤峰
	11561505=通辽
	11561506=鄂尔多斯
	11561507=呼伦贝尔
	11561508=巴彦淖尔
	11561509=乌兰察布
	11561522=兴安盟
	11561525=锡林郭勒
	11561529=阿拉善
	115621=辽宁
	11562101=沈阳
	11562102=大连
	11562103=鞍山
	11562104=抚顺
	11562105=本溪
	11562106=丹东
	11562107=锦州
	11562108=营口
	11562109=阜新
	11562110=辽阳
	11562111=盘锦
	11562112=铁岭
	11562113=朝阳
	11562114=葫芦岛
	115622=吉林
	11562201=长春
	11562202=吉林
	11562203=四平
	11562204=辽源
	11562205=通化
	11562206=白山
	11562207=松原
	11562208=白城
	11562224=延边
	115623=黑龙江
	11562301=哈尔滨
	11562302=齐齐哈尔
	11562303=鸡西
	11562304=鹤岗
	11562305=双鸭山
	11562306=大庆
	11562307=伊春
	11562308=佳木斯
	11562309=七台河
	11562310=牡丹江
	11562311=黑河
	11562312=绥化
	11562327=大兴安岭
	115632=江苏
	11563201=南京
	11563202=无锡
	11563203=徐州
	11563204=常州
	11563205=苏州
	11563206=南通
	11563207=连云港
	11563208=淮安
	11563209=盐城
	11563210=扬州
	11563211=镇江
	11563212=泰州
	11563213=宿迁
	115633=浙江
	11563301=杭州
	11563302=宁波
	11563303=温州
	11563304=嘉兴
	11563305=湖州
	11563306=绍兴
	11563307=金华
	11563308=衢州
	11563309=舟山
	11563310=台州
	11563311=丽水
	115634=安徽
	11563401=合肥
	11563402=芜湖
	11563403=蚌埠
	11563404=淮南
	11563405=马鞍山
	11563406=淮北
	11563407=铜陵
	11563408=安庆
	11563410=黄山
	11563411=滁州
	11563412=阜阳
	11563413=宿州
	11563415=六安
	11563416=亳州
	11563417=池州
	11563418=宣城
	115635=福建
	11563501=福州
	11563502=厦门
	11563503=莆田
	11563504=三明
	11563505=泉州
	11563506=漳州
	11563507=南平
	11563508=龙岩
	11563509=宁德
	115636=江西
	11563601=南昌
	11563602=景德镇
	11563603=萍乡
	11563604=九江
	11563605=新余
	11563606=鹰潭
	11563607=赣州
	11563608=吉安
	11563609=宜春
	11563610=抚州
	11563611=上饶
	115637=山东
	11563701=济南
	11563702=青岛
	11563703=淄博
	11563704=枣庄
	11563705=东营
	11563706=烟台
	11563707=潍坊
	11563708=济宁
	11563709=泰安
	11563710=威海
	11563711=日照
	11563712=莱芜
	11563713=临沂
	11563714=德州
	11563715=聊城
	11563716=滨州
	11563717=菏泽
	115641=河南
	11564101=郑州
	11564102=开封
	11564103=洛阳
	11564104=平顶山
	11564105=安阳
	11564106=鹤壁
	11564107=新乡
	11564108=焦作
	11564109=濮阳
	11564110=许昌
	11564111=漯河
	11564112=三门峡
	11564113=南阳
	11564114=商丘
	11564115=信阳
	11564116=周口
	11564117=驻马店
	115642=湖北
	11564201=武汉
	11564202=黄石
	11564203=十堰
	11564205=宜昌
	11564206=襄阳
	11564207=鄂州
	11564208=荆门
	11564209=孝感
	11564210=荆州
	11564211=黄冈
	11564212=咸宁
	11564213=随州
	11564228=恩施
	115643=湖南
	11564301=长沙
	11564302=株洲
	11564303=湘潭
	11564304=衡阳
	11564305=邵阳
	11564306=岳阳
	11564307=常德
	11564308=张家界
	11564309=益阳
	11564310=郴州
	11564311=永州
	11564312=怀化
	11564313=娄底
	11564331=湘西
	115644=广东
	11564401=广州
	11564402=韶关
	11564403=深圳
	11564404=珠海
	11564405=汕头
	11564406=佛山
	11564407=江门
	11564408=湛江
	11564409=茂名
	11564412=肇庆
	11564413=惠州
	11564414=梅州
	11564415=汕尾
	11564416=河源
	11564417=阳江
	11564418=清远
	11564419=东莞
	11564420=中山
	11564451=潮州
	11564452=揭阳
	11564453=云浮
	115645=广西
	11564501=南宁
	11564502=柳州
	11564503=桂林
	11564504=梧州
	11564505=北海
	11564506=防城港
	11564507=钦州
	11564508=贵港
	11564509=玉林
	11564510=百色
	11564511=贺州
	11564512=河池
	11564513=来宾
	11564514=崇左
	115646=海南
	11564601=海口
	11564602=三亚
	11564603=三沙
	11564604=儋州
	115651=四川
	11565101=成都
	11565103=自贡
	11565104=攀枝花
	11565105=泸州
	11565106=德阳
	11565107=绵阳
	11565108=广元
	11565109=遂宁
	11565110=内江
	11565111=乐山
	11565113=南充
	11565114=眉山
	11565115=宜宾
	11565116=广安
	11565117=达州
	11565118=雅安
	11565119=巴中
	11565120=资阳
	11565132=阿坝
	11565133=甘孜
	11565134=凉山
	115652=贵州
	11565201=贵阳
	11565202=六盘水
	11565203=遵义
	11565204=安顺
	11565222=铜仁
	11565223=黔西南
	11565224=毕节
	11565226=黔东南
	11565227=黔南
	115653=云南
	11565301=昆明
	11565303=曲靖
	11565304=玉溪
	11565305=保山
	11565306=昭通
	11565307=丽江
	11565308=普洱
	11565309=临沧
	11565323=楚雄
	11565325=红河
	11565326=文山
	11565328=西双版纳
	11565329=大理
	11565331=德宏
	11565333=怒江
	11565334=迪庆
	115654=西藏
	11565401=拉萨
	11565421=昌都
	11565422=山南
	11565423=日喀则
	11565424=那曲
	11565425=阿里
	11565426=林芝
	115661=陕西
	11566101=西安
	11566102=铜川
	11566103=宝鸡
	11566104=咸阳
	11566105=渭南
	11566106=延安
	11566107=汉中
	11566108=榆林
	11566109=安康
	11566110=商洛
	115662=甘肃
	11566201=兰州
	11566202=嘉峪关
	11566203=金昌
	11566204=白银
	11566205=天水
	11566206=武威
	11566207=张掖
	11566208=平凉
	11566209=酒泉
	11566210=庆阳
	11566211=定西
	11566212=陇南
	11566229=临夏
	11566230=甘南
	115663=青海
	11566301=西宁
	11566321=海东
	11566322=海北
	11566323=黄南
	11566325=海南
	11566326=果洛
	11566327=玉树
	11566328=海西
	115664=宁夏
	11566401=银川
	11566402=石嘴山
	11566403=吴忠
	11566404=固原
	11566405=中卫
	115665=新疆
	11566501=乌鲁木齐
	11566502=克拉玛依
	11566521=吐鲁番
	11566522=哈密
	11566523=昌吉
	11566527=博尔塔拉
	11566528=巴音郭楞
	11566529=阿克苏
	11566530=克孜勒苏
	11566531=喀什
	11566532=和田
	11566540=伊犁
	11566542=塔城
	11566543=阿勒泰`

	arr := strings.Split(areatmp, `
	`)

	for _, value := range arr {

		v_tmp := strings.Split(value, "=")
		if len(v_tmp) == 2 {
			area[v_tmp[0]] = v_tmp[1]
		}
	}
}

//通过region_id获取地域名称
func Get_Area_Name(region_id string) string {
	if len(region_id) >= 8 {
		if area[region_id[0:8]] != "" {
			return area[region_id[0:8]]
		}
		if area[region_id[0:6]] != "" {
			return area[region_id[0:6]]
		}
	}

	return "本地"
}


//加载IP入内存
func LoadIps_ini(ipv4_path, ipv6_path, lbs_path string) {
	sysIp = new(Ips)

	sysIp.Ipv4s = load_ips(ipv4_path, "ipv4")
	sysIp.Ipv6s = load_ips(ipv6_path, "ipv6")
	//sysIp.Lbs = load_lbs(lbs_path)
}

//通过Ip获取域
func Get_Region_Id(ip string) string {
	req := ""

	ip_b := net.ParseIP(ip)
	if ip_b == nil {
		return "0"
	}

	if strings.Contains(ip, ":") {
		req = ip_search(sysIp.Ipv6s, ip_b)
	} else {
		req = ip_search(sysIp.Ipv4s, ip_b)
	}

	if req == "" {
		return "0"
	}

	return req
}

//加载IP
func load_ips(file_path, ip_type string) []map[string][]byte {
	file, err := os.Open(file_path)
	if err != nil {
		fmt.Println("open file err:", file_path, err.Error())
	}
	defer file.Close()

	var ips []map[string][]byte
	if ip_type == "ipv6" {
		ips = make([]map[string][]byte, 0, 150000)
	} else {
		
		ips = make([]map[string][]byte, 0, 400000)
	}

	buf := bufio.NewReader(file)
	for {
		l, err := buf.ReadString('\n')
		line := strings.TrimSpace(l)
		if err != nil {
			if err != io.EOF {
				fmt.Println("read ip line err:", file_path, err.Error())
			}
			if len(line) == 0 {
				break
			}
		}
		line = strings.Replace(line, `"`, "", -1)
		line_tmp := strings.Split(line, ",")
		if len(line_tmp) != 3 && len(line_tmp) != 4{
			continue
		} else {
			ip := make(map[string][]byte, 4)
			ip["s"] = net.ParseIP(line_tmp[0])
			ip["e"] = net.ParseIP(line_tmp[1])
			ip["v"] = []byte(line_tmp[2])
			ips = append(ips, ip)
		}
	}

	return ips
}

//通过IP段获取地域ID
func ip_search(ips []map[string][]byte, sip []byte) string {
	var region_id []byte
	low := 0
	height := len(ips) - 1

	for low <= height {
		mid := low + (height-low)/2
		ip := ips[mid]
		cmp_s := bytes.Compare(ip["s"], sip)
		cmp_e := bytes.Compare(ip["e"], sip)

		//如果a==b返回0；如果a<b返回-1；否则返回+1
		if cmp_s < 1 && cmp_e > -1 {
			region_id = ip["v"]
			return string(region_id)
		} else if cmp_s == 1 {
			height = mid - 1
		} else if cmp_s == -1 {
			low = mid + 1
		}
	}

	return string(region_id)
}


